In [54]:
import pandas as pd

In [55]:
df = pd.read_csv('../data/Olof_Save_GBG_avg_daily_temp_data.csv', parse_dates=['Datum', 'Year'])

In [56]:
df.dtypes

Datum             datetime64[ns]
Kvalitet                  object
Snittemperatur           float64
Year              datetime64[ns]
dtype: object

In [57]:
df['Year'] = df['Datum'].dt.year
df['Month'] = df['Datum'].dt.month

In [58]:
monthly_averages = df.groupby(['Year', 'Month'])['Snittemperatur'].mean().round(2).reset_index()

In [59]:
monthly_averages = monthly_averages.rename({'Snittemperatur': 'Monthly_avg_temp'}, axis=1)

In [60]:
df

           Datum Kvalitet  Snittemperatur  Year  Month
0     1944-01-01        G            3.20  1944      1
1     1944-01-02        G            3.60  1944      1
2     1944-01-03        G            2.80  1944      1
3     1944-01-04        G           -4.47  1944      1
4     1944-01-05        G           -1.40  1944      1
...          ...      ...             ...   ...    ...
29109 2023-10-12        G           12.08  2023     10
29110 2023-10-13        G           11.89  2023     10
29111 2023-10-14        G           11.54  2023     10
29112 2023-10-15        G           10.09  2023     10
29113 2023-10-16        G            4.27  2023     10

[29114 rows x 5 columns]

In [61]:
monthly_averages

     Year  Month  Monthly_avg_temp
0    1944      1              2.03
1    1944      2              0.18
2    1944      3              0.96
3    1944      4              6.08
4    1944      5             10.74
..    ...    ...               ...
953  2023      6             18.59
954  2023      7             16.78
955  2023      8             17.00
956  2023      9             17.02
957  2023     10             11.40

[958 rows x 3 columns]

In [62]:
df = df.merge(monthly_averages, how='left', on=['Year', 'Month'])

In [63]:
df

           Datum Kvalitet  Snittemperatur  Year  Month  Monthly_avg_temp
0     1944-01-01        G            3.20  1944      1              2.03
1     1944-01-02        G            3.60  1944      1              2.03
2     1944-01-03        G            2.80  1944      1              2.03
3     1944-01-04        G           -4.47  1944      1              2.03
4     1944-01-05        G           -1.40  1944      1              2.03
...          ...      ...             ...   ...    ...               ...
29109 2023-10-12        G           12.08  2023     10             11.40
29110 2023-10-13        G           11.89  2023     10             11.40
29111 2023-10-14        G           11.54  2023     10             11.40
29112 2023-10-15        G           10.09  2023     10             11.40
29113 2023-10-16        G            4.27  2023     10             11.40

[29114 rows x 6 columns]

In [64]:
df = df.groupby(['Year', 'Month'])['Monthly_avg_temp'].max().reset_index()

In [65]:
df

     Year  Month  Monthly_avg_temp
0    1944      1              2.03
1    1944      2              0.18
2    1944      3              0.96
3    1944      4              6.08
4    1944      5             10.74
..    ...    ...               ...
953  2023      6             18.59
954  2023      7             16.78
955  2023      8             17.00
956  2023      9             17.02
957  2023     10             11.40

[958 rows x 3 columns]

In [66]:
df.to_csv('../data/Olof_Save_GBG_avg_monthly_temp_data.csv', mode='w', index=False)